photogur/app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    @pictures = Picture.all

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @picture = Picture.find(params[:id])